#Контейнер для задач по Python (занятие 1, задачи 1-10)
#(занятие 2, задачи 11-13)

#Task 1
#Cоздать переменные разных типов и отобразить их типы на экране."
#1. Целочисленного типа
a = 1
#2. Вещественного типа
b = 5.5
#3. Логического типа
c = True; d = False
#4. Строкового типа
d = "Привет!"
#5. Пустого типа
from asyncio.windows_events import NULL # для совместимости с Windows, строка была предложена IDE
e = NULL
#Вывести их типы.
print (a, b, c, d)
