#todo: Заданы множества
# все пользователи
#all_users = {'id3', 'id5', 'id9', 'id8', 'id2', 'id1', 'id4', 'id6', 'id7', 'id10'}

# пользователи не в сети
#offline_users = {'id3', 'id9', 'id7', 'id2', 'id4', 'id6'}

#Вычислить пользователей online

# Все пользователи
all_users = {'id3', 'id5', 'id9', 'id8', 'id2', 'id1', 'id4', 'id6', 'id7', 'id10'}

# Пользователи не в сети
offline_users = {'id3', 'id9', 'id7', 'id2', 'id4', 'id6'}

# Вычисляем онлайн-пользователей — это разность множеств
online_users = all_users - offline_users

# Выводим результат
print("Пользователи онлайн:", online_users)

# Комментарий для фиксации в новом коммите



